SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_rac.h
/* Bit fields for RAC R0 */
#define _RAC_R0_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R0                    */
#define _RAC_R0_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R0                             */
#define _RAC_R0_R0_SHIFT                                              0                         /**< Shift value for RAC_R0                      */
#define _RAC_R0_R0_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R0                         */
#define _RAC_R0_R0_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R0                     */
#define RAC_R0_R0_DEFAULT                                             (_RAC_R0_R0_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R0             */

/* Bit fields for RAC R1 */
#define _RAC_R1_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R1                    */
#define _RAC_R1_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R1                             */
#define _RAC_R1_R1_SHIFT                                              0                         /**< Shift value for RAC_R1                      */
#define _RAC_R1_R1_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R1                         */
#define _RAC_R1_R1_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R1                     */
#define RAC_R1_R1_DEFAULT                                             (_RAC_R1_R1_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R1             */

/* Bit fields for RAC R2 */
#define _RAC_R2_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R2                    */
#define _RAC_R2_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R2                             */
#define _RAC_R2_R2_SHIFT                                              0                         /**< Shift value for RAC_R2                      */
#define _RAC_R2_R2_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R2                         */
#define _RAC_R2_R2_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R2                     */
#define RAC_R2_R2_DEFAULT                                             (_RAC_R2_R2_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R2             */

/* Bit fields for RAC R3 */
#define _RAC_R3_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R3                    */
#define _RAC_R3_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R3                             */
#define _RAC_R3_R3_SHIFT                                              0                         /**< Shift value for RAC_R3                      */
#define _RAC_R3_R3_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R3                         */
#define _RAC_R3_R3_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R3                     */
#define RAC_R3_R3_DEFAULT                                             (_RAC_R3_R3_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R3             */

/* Bit fields for RAC R4 */
#define _RAC_R4_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R4                    */
#define _RAC_R4_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R4                             */
#define _RAC_R4_R4_SHIFT                                              0                         /**< Shift value for RAC_R4                      */
#define _RAC_R4_R4_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R4                         */
#define _RAC_R4_R4_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R4                     */
#define RAC_R4_R4_DEFAULT                                             (_RAC_R4_R4_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R4             */

/* Bit fields for RAC R5 */
#define _RAC_R5_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R5                    */
#define _RAC_R5_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R5                             */
#define _RAC_R5_R5_SHIFT                                              0                         /**< Shift value for RAC_R5                      */
#define _RAC_R5_R5_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R5                         */
#define _RAC_R5_R5_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R5                     */
#define RAC_R5_R5_DEFAULT                                             (_RAC_R5_R5_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R5             */

/* Bit fields for RAC R6 */
#define _RAC_R6_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R6                    */
#define _RAC_R6_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R6                             */
#define _RAC_R6_R6_SHIFT                                              0                         /**< Shift value for RAC_R6                      */
#define _RAC_R6_R6_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R6                         */
#define _RAC_R6_R6_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R6                     */
#define RAC_R6_R6_DEFAULT                                             (_RAC_R6_R6_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R6             */

/* Bit fields for RAC R7 */
#define _RAC_R7_RESETVALUE                                            0x00000000UL              /**< Default value for RAC_R7                    */
#define _RAC_R7_MASK                                                  0xFFFFFFFFUL              /**< Mask for RAC_R7                             */
#define _RAC_R7_R7_SHIFT                                              0                         /**< Shift value for RAC_R7                      */
#define _RAC_R7_R7_MASK                                               0xFFFFFFFFUL              /**< Bit mask for RAC_R7                         */
#define _RAC_R7_R7_DEFAULT                                            0x00000000UL              /**< Mode DEFAULT for RAC_R7                     */
#define RAC_R7_R7_DEFAULT                                             (_RAC_R7_R7_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_R7             */

/* Bit fields for RAC WAITMASK */
#define _RAC_WAITMASK_RESETVALUE                                      0x00000000UL                               /**< Default value for RAC_WAITMASK              */
#define _RAC_WAITMASK_MASK                                            0x000001FFUL                               /**< Mask for RAC_WAITMASK                       */
#define RAC_WAITMASK_STCMP                                            (0x1UL << 0)                               /**< STIMER Compare Event                        */
#define _RAC_WAITMASK_STCMP_SHIFT                                     0                                          /**< Shift value for RAC_STCMP                   */
#define _RAC_WAITMASK_STCMP_MASK                                      0x1UL                                      /**< Bit mask for RAC_STCMP                      */
#define _RAC_WAITMASK_STCMP_DEFAULT                                   0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_STCMP_DEFAULT                                    (_RAC_WAITMASK_STCMP_DEFAULT << 0)         /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_FRCRX                                            (0x1UL << 1)                               /**< FRC RXWord                                  */
#define _RAC_WAITMASK_FRCRX_SHIFT                                     1                                          /**< Shift value for RAC_FRCRX                   */
#define _RAC_WAITMASK_FRCRX_MASK                                      0x2UL                                      /**< Bit mask for RAC_FRCRX                      */
#define _RAC_WAITMASK_FRCRX_DEFAULT                                   0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_FRCRX_DEFAULT                                    (_RAC_WAITMASK_FRCRX_DEFAULT << 1)         /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_FRCTX                                            (0x1UL << 2)                               /**< FRC TXWord                                  */
#define _RAC_WAITMASK_FRCTX_SHIFT                                     2                                          /**< Shift value for RAC_FRCTX                   */
#define _RAC_WAITMASK_FRCTX_MASK                                      0x4UL                                      /**< Bit mask for RAC_FRCTX                      */
#define _RAC_WAITMASK_FRCTX_DEFAULT                                   0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_FRCTX_DEFAULT                                    (_RAC_WAITMASK_FRCTX_DEFAULT << 2)         /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_PRSEVENT                                         (0x1UL << 3)                               /**< PRS Event                                   */
#define _RAC_WAITMASK_PRSEVENT_SHIFT                                  3                                          /**< Shift value for RAC_PRSEVENT                */
#define _RAC_WAITMASK_PRSEVENT_MASK                                   0x8UL                                      /**< Bit mask for RAC_PRSEVENT                   */
#define _RAC_WAITMASK_PRSEVENT_DEFAULT                                0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_PRSEVENT_DEFAULT                                 (_RAC_WAITMASK_PRSEVENT_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_DEMODRXREQCLR                                    (0x1UL << 4)                               /**< Demodulator RX Request Clear                */
#define _RAC_WAITMASK_DEMODRXREQCLR_SHIFT                             4                                          /**< Shift value for RAC_DEMODRXREQCLR           */
#define _RAC_WAITMASK_DEMODRXREQCLR_MASK                              0x10UL                                     /**< Bit mask for RAC_DEMODRXREQCLR              */
#define _RAC_WAITMASK_DEMODRXREQCLR_DEFAULT                           0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_DEMODRXREQCLR_DEFAULT                            (_RAC_WAITMASK_DEMODRXREQCLR_DEFAULT << 4) /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_SYNTHRDY                                         (0x1UL << 5)                               /**< SYNTH Ready                                 */
#define _RAC_WAITMASK_SYNTHRDY_SHIFT                                  5                                          /**< Shift value for RAC_SYNTHRDY                */
#define _RAC_WAITMASK_SYNTHRDY_MASK                                   0x20UL                                     /**< Bit mask for RAC_SYNTHRDY                   */
#define _RAC_WAITMASK_SYNTHRDY_DEFAULT                                0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_SYNTHRDY_DEFAULT                                 (_RAC_WAITMASK_SYNTHRDY_DEFAULT << 5)      /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_RAMPDONE                                         (0x1UL << 6)                               /**< Ramp Done                                   */
#define _RAC_WAITMASK_RAMPDONE_SHIFT                                  6                                          /**< Shift value for RAC_RAMPDONE                */
#define _RAC_WAITMASK_RAMPDONE_MASK                                   0x40UL                                     /**< Bit mask for RAC_RAMPDONE                   */
#define _RAC_WAITMASK_RAMPDONE_DEFAULT                                0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_RAMPDONE_DEFAULT                                 (_RAC_WAITMASK_RAMPDONE_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_FRCPAUSED                                        (0x1UL << 7)                               /**< FRC Paused                                  */
#define _RAC_WAITMASK_FRCPAUSED_SHIFT                                 7                                          /**< Shift value for RAC_FRCPAUSED               */
#define _RAC_WAITMASK_FRCPAUSED_MASK                                  0x80UL                                     /**< Bit mask for RAC_FRCPAUSED                  */
#define _RAC_WAITMASK_FRCPAUSED_DEFAULT                               0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_FRCPAUSED_DEFAULT                                (_RAC_WAITMASK_FRCPAUSED_DEFAULT << 7)     /**< Shifted mode DEFAULT for RAC_WAITMASK       */
#define RAC_WAITMASK_ANTSWITCH                                        (0x1UL << 8)                               /**< Active antenna has switched                 */
#define _RAC_WAITMASK_ANTSWITCH_SHIFT                                 8                                          /**< Shift value for RAC_ANTSWITCH               */
#define _RAC_WAITMASK_ANTSWITCH_MASK                                  0x100UL                                    /**< Bit mask for RAC_ANTSWITCH                  */
#define _RAC_WAITMASK_ANTSWITCH_DEFAULT                               0x00000000UL                               /**< Mode DEFAULT for RAC_WAITMASK               */
#define RAC_WAITMASK_ANTSWITCH_DEFAULT                                (_RAC_WAITMASK_ANTSWITCH_DEFAULT << 8)     /**< Shifted mode DEFAULT for RAC_WAITMASK       */

/* Bit fields for RAC WAITSNSH */
#define _RAC_WAITSNSH_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_WAITSNSH              */
#define _RAC_WAITSNSH_MASK                                            0x000003FFUL                          /**< Mask for RAC_WAITSNSH                       */
#define _RAC_WAITSNSH_WAITSNSH_SHIFT                                  0                                     /**< Shift value for RAC_WAITSNSH                */
#define _RAC_WAITSNSH_WAITSNSH_MASK                                   0x3FFUL                               /**< Bit mask for RAC_WAITSNSH                   */
#define _RAC_WAITSNSH_WAITSNSH_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_WAITSNSH               */
#define RAC_WAITSNSH_WAITSNSH_DEFAULT                                 (_RAC_WAITSNSH_WAITSNSH_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_WAITSNSH       */

/* Bit fields for RAC STIMER */
#define _RAC_STIMER_RESETVALUE                                        0x00000000UL                      /**< Default value for RAC_STIMER                */
#define _RAC_STIMER_MASK                                              0x0000FFFFUL                      /**< Mask for RAC_STIMER                         */
#define _RAC_STIMER_STIMER_SHIFT                                      0                                 /**< Shift value for RAC_STIMER                  */
#define _RAC_STIMER_STIMER_MASK                                       0xFFFFUL                          /**< Bit mask for RAC_STIMER                     */
#define _RAC_STIMER_STIMER_DEFAULT                                    0x00000000UL                      /**< Mode DEFAULT for RAC_STIMER                 */
#define RAC_STIMER_STIMER_DEFAULT                                     (_RAC_STIMER_STIMER_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_STIMER         */

/* Bit fields for RAC STIMERCOMP */
#define _RAC_STIMERCOMP_RESETVALUE                                    0x00000000UL                              /**< Default value for RAC_STIMERCOMP            */
#define _RAC_STIMERCOMP_MASK                                          0x0000FFFFUL                              /**< Mask for RAC_STIMERCOMP                     */
#define _RAC_STIMERCOMP_STIMERCOMP_SHIFT                              0                                         /**< Shift value for RAC_STIMERCOMP              */
#define _RAC_STIMERCOMP_STIMERCOMP_MASK                               0xFFFFUL                                  /**< Bit mask for RAC_STIMERCOMP                 */
#define _RAC_STIMERCOMP_STIMERCOMP_DEFAULT                            0x00000000UL                              /**< Mode DEFAULT for RAC_STIMERCOMP             */
#define RAC_STIMERCOMP_STIMERCOMP_DEFAULT                             (_RAC_STIMERCOMP_STIMERCOMP_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_STIMERCOMP     */

/* Bit fields for RAC VECTADDR */
#define _RAC_VECTADDR_RESETVALUE                                      0x00000000UL                          /**< Default value for RAC_VECTADDR              */
#define _RAC_VECTADDR_MASK                                            0xFFFFFFFFUL                          /**< Mask for RAC_VECTADDR                       */
#define _RAC_VECTADDR_VECTADDR_SHIFT                                  0                                     /**< Shift value for RAC_VECTADDR                */
#define _RAC_VECTADDR_VECTADDR_MASK                                   0xFFFFFFFFUL                          /**< Bit mask for RAC_VECTADDR                   */
#define _RAC_VECTADDR_VECTADDR_DEFAULT                                0x00000000UL                          /**< Mode DEFAULT for RAC_VECTADDR               */
#define RAC_VECTADDR_VECTADDR_DEFAULT                                 (_RAC_VECTADDR_VECTADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_VECTADDR       */

