SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_rac.h
/* Bit fields for RAC PATRIM0 */
#define _RAC_PATRIM0_RESETVALUE                                       0x20088D93UL                                         /**< Default value for RAC_PATRIM0               */
#define _RAC_PATRIM0_MASK                                             0x3FFFFFFFUL                                         /**< Mask for RAC_PATRIM0                        */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_SHIFT                     0                                                    /**< Shift value for RAC_PATRIMDRVREGIBCORE0DBM  */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_MASK                      0x3UL                                                /**< Bit mask for RAC_PATRIMDRVREGIBCORE0DBM     */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_DEFAULT                   0x00000003UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_4u                      0x00000000UL                                         /**< Mode i_4u for RAC_PATRIM0                   */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_5u                      0x00000001UL                                         /**< Mode i_5u for RAC_PATRIM0                   */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_6u                      0x00000002UL                                         /**< Mode i_6u for RAC_PATRIM0                   */
#define _RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_7u                      0x00000003UL                                         /**< Mode i_7u for RAC_PATRIM0                   */
#define RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_DEFAULT                    (_RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_DEFAULT << 0)   /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_4u                       (_RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_4u << 0)      /**< Shifted mode i_4u for RAC_PATRIM0           */
#define RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_5u                       (_RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_5u << 0)      /**< Shifted mode i_5u for RAC_PATRIM0           */
#define RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_6u                       (_RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_6u << 0)      /**< Shifted mode i_6u for RAC_PATRIM0           */
#define RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_7u                       (_RAC_PATRIM0_PATRIMDRVREGIBCORE0DBM_i_7u << 0)      /**< Shifted mode i_7u for RAC_PATRIM0           */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_SHIFT                     2                                                    /**< Shift value for RAC_PATRIMDRVREGIBNDIO0DBM  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_MASK                      0x3CUL                                               /**< Bit mask for RAC_PATRIMDRVREGIBNDIO0DBM     */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_DEFAULT                   0x00000004UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p09                 0x00000000UL                                         /**< Mode vreg_1p09 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p13                 0x00000001UL                                         /**< Mode vreg_1p13 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p16                 0x00000002UL                                         /**< Mode vreg_1p16 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p20                 0x00000003UL                                         /**< Mode vreg_1p20 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p23                 0x00000004UL                                         /**< Mode vreg_1p23 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p25                 0x00000005UL                                         /**< Mode vreg_1p25 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p28                 0x00000006UL                                         /**< Mode vreg_1p28 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p31                 0x00000007UL                                         /**< Mode vreg_1p31 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p33                 0x00000008UL                                         /**< Mode vreg_1p33 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p36                 0x00000009UL                                         /**< Mode vreg_1p36 for RAC_PATRIM0              */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_10                     0x0000000AUL                                         /**< Mode NA_10 for RAC_PATRIM0                  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_11                     0x0000000BUL                                         /**< Mode NA_11 for RAC_PATRIM0                  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_12                     0x0000000CUL                                         /**< Mode NA_12 for RAC_PATRIM0                  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_13                     0x0000000DUL                                         /**< Mode NA_13 for RAC_PATRIM0                  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_14                     0x0000000EUL                                         /**< Mode NA_14 for RAC_PATRIM0                  */
#define _RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_15                     0x0000000FUL                                         /**< Mode NA_15 for RAC_PATRIM0                  */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_DEFAULT                    (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_DEFAULT << 2)   /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p09                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p09 << 2) /**< Shifted mode vreg_1p09 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p13                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p13 << 2) /**< Shifted mode vreg_1p13 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p16                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p16 << 2) /**< Shifted mode vreg_1p16 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p20                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p20 << 2) /**< Shifted mode vreg_1p20 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p23                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p23 << 2) /**< Shifted mode vreg_1p23 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p25                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p25 << 2) /**< Shifted mode vreg_1p25 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p28                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p28 << 2) /**< Shifted mode vreg_1p28 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p31                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p31 << 2) /**< Shifted mode vreg_1p31 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p33                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p33 << 2) /**< Shifted mode vreg_1p33 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p36                  (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_vreg_1p36 << 2) /**< Shifted mode vreg_1p36 for RAC_PATRIM0      */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_10                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_10 << 2)     /**< Shifted mode NA_10 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_11                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_11 << 2)     /**< Shifted mode NA_11 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_12                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_12 << 2)     /**< Shifted mode NA_12 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_13                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_13 << 2)     /**< Shifted mode NA_13 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_14                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_14 << 2)     /**< Shifted mode NA_14 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_15                      (_RAC_PATRIM0_PATRIMDRVREGIBNDIO0DBM_NA_15 << 2)     /**< Shifted mode NA_15 for RAC_PATRIM0          */
#define RAC_PATRIM0_PATRIMDRVREGPSR0DBM                               (0x1UL << 6)                                         /**< PATRIMDRVREGPSR0DBM                         */
#define _RAC_PATRIM0_PATRIMDRVREGPSR0DBM_SHIFT                        6                                                    /**< Shift value for RAC_PATRIMDRVREGPSR0DBM     */
#define _RAC_PATRIM0_PATRIMDRVREGPSR0DBM_MASK                         0x40UL                                               /**< Bit mask for RAC_PATRIMDRVREGPSR0DBM        */
#define _RAC_PATRIM0_PATRIMDRVREGPSR0DBM_DEFAULT                      0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMDRVREGPSR0DBM_disable                      0x00000000UL                                         /**< Mode disable for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMDRVREGPSR0DBM_enable                       0x00000001UL                                         /**< Mode enable for RAC_PATRIM0                 */
#define RAC_PATRIM0_PATRIMDRVREGPSR0DBM_DEFAULT                       (_RAC_PATRIM0_PATRIMDRVREGPSR0DBM_DEFAULT << 6)      /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMDRVREGPSR0DBM_disable                       (_RAC_PATRIM0_PATRIMDRVREGPSR0DBM_disable << 6)      /**< Shifted mode disable for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMDRVREGPSR0DBM_enable                        (_RAC_PATRIM0_PATRIMDRVREGPSR0DBM_enable << 6)       /**< Shifted mode enable for RAC_PATRIM0         */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_SHIFT                         7                                                    /**< Shift value for RAC_PATRIMDRVSLICE0DBM      */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_MASK                          0x180UL                                              /**< Bit mask for RAC_PATRIMDRVSLICE0DBM         */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_DEFAULT                       0x00000003UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_0_slice                    0x00000000UL                                         /**< Mode on_0_slice for RAC_PATRIM0             */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_1_slice                    0x00000001UL                                         /**< Mode on_1_slice for RAC_PATRIM0             */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_2_slice                    0x00000002UL                                         /**< Mode on_2_slice for RAC_PATRIM0             */
#define _RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_3_slice                    0x00000003UL                                         /**< Mode on_3_slice for RAC_PATRIM0             */
#define RAC_PATRIM0_PATRIMDRVSLICE0DBM_DEFAULT                        (_RAC_PATRIM0_PATRIMDRVSLICE0DBM_DEFAULT << 7)       /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_0_slice                     (_RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_0_slice << 7)    /**< Shifted mode on_0_slice for RAC_PATRIM0     */
#define RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_1_slice                     (_RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_1_slice << 7)    /**< Shifted mode on_1_slice for RAC_PATRIM0     */
#define RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_2_slice                     (_RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_2_slice << 7)    /**< Shifted mode on_2_slice for RAC_PATRIM0     */
#define RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_3_slice                     (_RAC_PATRIM0_PATRIMDRVSLICE0DBM_on_3_slice << 7)    /**< Shifted mode on_3_slice for RAC_PATRIM0     */
#define _RAC_PATRIM0_PATRIMFB0DBM_SHIFT                               9                                                    /**< Shift value for RAC_PATRIMFB0DBM            */
#define _RAC_PATRIM0_PATRIMFB0DBM_MASK                                0x1E00UL                                             /**< Bit mask for RAC_PATRIMFB0DBM               */
#define _RAC_PATRIM0_PATRIMFB0DBM_DEFAULT                             0x00000006UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p475                         0x00000000UL                                         /**< Mode vo_vi_0p475 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p500                         0x00000001UL                                         /**< Mode vo_vi_0p500 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p525                         0x00000002UL                                         /**< Mode vo_vi_0p525 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p550                         0x00000003UL                                         /**< Mode vo_vi_0p550 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p575                         0x00000004UL                                         /**< Mode vo_vi_0p575 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p600                         0x00000005UL                                         /**< Mode vo_vi_0p600 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p625                         0x00000006UL                                         /**< Mode vo_vi_0p625 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p650                         0x00000007UL                                         /**< Mode vo_vi_0p650 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p675                         0x00000008UL                                         /**< Mode vo_vi_0p675 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p700                         0x00000009UL                                         /**< Mode vo_vi_0p700 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p725                         0x0000000AUL                                         /**< Mode vo_vi_0p725 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p750                         0x0000000BUL                                         /**< Mode vo_vi_0p750 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p775                         0x0000000CUL                                         /**< Mode vo_vi_0p775 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p80                          0x0000000DUL                                         /**< Mode vo_vi_0p80 for RAC_PATRIM0             */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p825                         0x0000000EUL                                         /**< Mode vo_vi_0p825 for RAC_PATRIM0            */
#define _RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p85                          0x0000000FUL                                         /**< Mode vo_vi_0p85 for RAC_PATRIM0             */
#define RAC_PATRIM0_PATRIMFB0DBM_DEFAULT                              (_RAC_PATRIM0_PATRIMFB0DBM_DEFAULT << 9)             /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p475                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p475 << 9)         /**< Shifted mode vo_vi_0p475 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p500                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p500 << 9)         /**< Shifted mode vo_vi_0p500 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p525                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p525 << 9)         /**< Shifted mode vo_vi_0p525 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p550                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p550 << 9)         /**< Shifted mode vo_vi_0p550 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p575                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p575 << 9)         /**< Shifted mode vo_vi_0p575 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p600                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p600 << 9)         /**< Shifted mode vo_vi_0p600 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p625                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p625 << 9)         /**< Shifted mode vo_vi_0p625 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p650                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p650 << 9)         /**< Shifted mode vo_vi_0p650 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p675                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p675 << 9)         /**< Shifted mode vo_vi_0p675 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p700                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p700 << 9)         /**< Shifted mode vo_vi_0p700 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p725                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p725 << 9)         /**< Shifted mode vo_vi_0p725 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p750                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p750 << 9)         /**< Shifted mode vo_vi_0p750 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p775                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p775 << 9)         /**< Shifted mode vo_vi_0p775 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p80                           (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p80 << 9)          /**< Shifted mode vo_vi_0p80 for RAC_PATRIM0     */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p825                          (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p825 << 9)         /**< Shifted mode vo_vi_0p825 for RAC_PATRIM0    */
#define RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p85                           (_RAC_PATRIM0_PATRIMFB0DBM_vo_vi_0p85 << 9)          /**< Shifted mode vo_vi_0p85 for RAC_PATRIM0     */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_SHIFT                          13                                                   /**< Shift value for RAC_PATRIMPABIASN0DBM       */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_MASK                           0x1E000UL                                            /**< Bit mask for RAC_PATRIMPABIASN0DBM          */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_DEFAULT                        0x00000004UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_450m                         0x00000000UL                                         /**< Mode v_450m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_462p5m                       0x00000001UL                                         /**< Mode v_462p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_475m                         0x00000002UL                                         /**< Mode v_475m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_487p5m                       0x00000003UL                                         /**< Mode v_487p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_500m                         0x00000004UL                                         /**< Mode v_500m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_512p5m                       0x00000005UL                                         /**< Mode v_512p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_525m                         0x00000006UL                                         /**< Mode v_525m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_537p5m                       0x00000007UL                                         /**< Mode v_537p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_550m                         0x00000008UL                                         /**< Mode v_550m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_562p5m                       0x00000009UL                                         /**< Mode v_562p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_575m                         0x0000000AUL                                         /**< Mode v_575m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_587p5m                       0x0000000BUL                                         /**< Mode v_587p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_600m                         0x0000000CUL                                         /**< Mode v_600m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_612p5m                       0x0000000DUL                                         /**< Mode v_612p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_625m                         0x0000000EUL                                         /**< Mode v_625m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASN0DBM_v_637p5m                       0x0000000FUL                                         /**< Mode v_637p5m for RAC_PATRIM0               */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_DEFAULT                         (_RAC_PATRIM0_PATRIMPABIASN0DBM_DEFAULT << 13)       /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_450m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_450m << 13)        /**< Shifted mode v_450m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_462p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_462p5m << 13)      /**< Shifted mode v_462p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_475m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_475m << 13)        /**< Shifted mode v_475m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_487p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_487p5m << 13)      /**< Shifted mode v_487p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_500m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_500m << 13)        /**< Shifted mode v_500m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_512p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_512p5m << 13)      /**< Shifted mode v_512p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_525m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_525m << 13)        /**< Shifted mode v_525m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_537p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_537p5m << 13)      /**< Shifted mode v_537p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_550m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_550m << 13)        /**< Shifted mode v_550m for RAC_PATRIM0         */
