SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_rac.h
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_562p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_562p5m << 13)      /**< Shifted mode v_562p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_575m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_575m << 13)        /**< Shifted mode v_575m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_587p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_587p5m << 13)      /**< Shifted mode v_587p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_600m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_600m << 13)        /**< Shifted mode v_600m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_612p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_612p5m << 13)      /**< Shifted mode v_612p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_625m                          (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_625m << 13)        /**< Shifted mode v_625m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASN0DBM_v_637p5m                        (_RAC_PATRIM0_PATRIMPABIASN0DBM_v_637p5m << 13)      /**< Shifted mode v_637p5m for RAC_PATRIM0       */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_SHIFT                          17                                                   /**< Shift value for RAC_PATRIMPABIASP0DBM       */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_MASK                           0x1E0000UL                                           /**< Bit mask for RAC_PATRIMPABIASP0DBM          */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_DEFAULT                        0x00000004UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_450m                         0x00000000UL                                         /**< Mode v_450m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_462p5m                       0x00000001UL                                         /**< Mode v_462p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_475m                         0x00000002UL                                         /**< Mode v_475m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_487p5m                       0x00000003UL                                         /**< Mode v_487p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_500m                         0x00000004UL                                         /**< Mode v_500m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_512p5m                       0x00000005UL                                         /**< Mode v_512p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_525m                         0x00000006UL                                         /**< Mode v_525m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_537p5m                       0x00000007UL                                         /**< Mode v_537p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_550m                         0x00000008UL                                         /**< Mode v_550m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_562p5m                       0x00000009UL                                         /**< Mode v_562p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_575m                         0x0000000AUL                                         /**< Mode v_575m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_587p5m                       0x0000000BUL                                         /**< Mode v_587p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_600m                         0x0000000CUL                                         /**< Mode v_600m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_612p5m                       0x0000000DUL                                         /**< Mode v_612p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_625m                         0x0000000EUL                                         /**< Mode v_625m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMPABIASP0DBM_v_637p5m                       0x0000000FUL                                         /**< Mode v_637p5m for RAC_PATRIM0               */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_DEFAULT                         (_RAC_PATRIM0_PATRIMPABIASP0DBM_DEFAULT << 17)       /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_450m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_450m << 17)        /**< Shifted mode v_450m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_462p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_462p5m << 17)      /**< Shifted mode v_462p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_475m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_475m << 17)        /**< Shifted mode v_475m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_487p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_487p5m << 17)      /**< Shifted mode v_487p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_500m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_500m << 17)        /**< Shifted mode v_500m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_512p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_512p5m << 17)      /**< Shifted mode v_512p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_525m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_525m << 17)        /**< Shifted mode v_525m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_537p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_537p5m << 17)      /**< Shifted mode v_537p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_550m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_550m << 17)        /**< Shifted mode v_550m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_562p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_562p5m << 17)      /**< Shifted mode v_562p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_575m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_575m << 17)        /**< Shifted mode v_575m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_587p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_587p5m << 17)      /**< Shifted mode v_587p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_600m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_600m << 17)        /**< Shifted mode v_600m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_612p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_612p5m << 17)      /**< Shifted mode v_612p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_625m                          (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_625m << 17)        /**< Shifted mode v_625m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMPABIASP0DBM_v_637p5m                        (_RAC_PATRIM0_PATRIMPABIASP0DBM_v_637p5m << 17)      /**< Shifted mode v_637p5m for RAC_PATRIM0       */
#define _RAC_PATRIM0_PATRIMPASLICE0DBM_SHIFT                          21                                                   /**< Shift value for RAC_PATRIMPASLICE0DBM       */
#define _RAC_PATRIM0_PATRIMPASLICE0DBM_MASK                           0x7E00000UL                                          /**< Bit mask for RAC_PATRIMPASLICE0DBM          */
#define _RAC_PATRIM0_PATRIMPASLICE0DBM_DEFAULT                        0x00000000UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_0                     0x00000000UL                                         /**< Mode on_slice_0 for RAC_PATRIM0             */
#define _RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_63                    0x0000003FUL                                         /**< Mode on_slice_63 for RAC_PATRIM0            */
#define RAC_PATRIM0_PATRIMPASLICE0DBM_DEFAULT                         (_RAC_PATRIM0_PATRIMPASLICE0DBM_DEFAULT << 21)       /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_0                      (_RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_0 << 21)    /**< Shifted mode on_slice_0 for RAC_PATRIM0     */
#define RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_63                     (_RAC_PATRIM0_PATRIMPASLICE0DBM_on_slice_63 << 21)   /**< Shifted mode on_slice_63 for RAC_PATRIM0    */
#define _RAC_PATRIM0_PATRIMVREF0DBM_SHIFT                             27                                                   /**< Shift value for RAC_PATRIMVREF0DBM          */
#define _RAC_PATRIM0_PATRIMVREF0DBM_MASK                              0x38000000UL                                         /**< Bit mask for RAC_PATRIMVREF0DBM             */
#define _RAC_PATRIM0_PATRIMVREF0DBM_DEFAULT                           0x00000004UL                                         /**< Mode DEFAULT for RAC_PATRIM0                */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_900m                            0x00000000UL                                         /**< Mode v_900m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_912p5m                          0x00000001UL                                         /**< Mode v_912p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_925m                            0x00000002UL                                         /**< Mode v_925m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_937p5m                          0x00000003UL                                         /**< Mode v_937p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_950m                            0x00000004UL                                         /**< Mode v_950m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_962p5m                          0x00000005UL                                         /**< Mode v_962p5m for RAC_PATRIM0               */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_975m                            0x00000006UL                                         /**< Mode v_975m for RAC_PATRIM0                 */
#define _RAC_PATRIM0_PATRIMVREF0DBM_v_987p5m                          0x00000007UL                                         /**< Mode v_987p5m for RAC_PATRIM0               */
#define RAC_PATRIM0_PATRIMVREF0DBM_DEFAULT                            (_RAC_PATRIM0_PATRIMVREF0DBM_DEFAULT << 27)          /**< Shifted mode DEFAULT for RAC_PATRIM0        */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_900m                             (_RAC_PATRIM0_PATRIMVREF0DBM_v_900m << 27)           /**< Shifted mode v_900m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_912p5m                           (_RAC_PATRIM0_PATRIMVREF0DBM_v_912p5m << 27)         /**< Shifted mode v_912p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_925m                             (_RAC_PATRIM0_PATRIMVREF0DBM_v_925m << 27)           /**< Shifted mode v_925m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_937p5m                           (_RAC_PATRIM0_PATRIMVREF0DBM_v_937p5m << 27)         /**< Shifted mode v_937p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_950m                             (_RAC_PATRIM0_PATRIMVREF0DBM_v_950m << 27)           /**< Shifted mode v_950m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_962p5m                           (_RAC_PATRIM0_PATRIMVREF0DBM_v_962p5m << 27)         /**< Shifted mode v_962p5m for RAC_PATRIM0       */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_975m                             (_RAC_PATRIM0_PATRIMVREF0DBM_v_975m << 27)           /**< Shifted mode v_975m for RAC_PATRIM0         */
#define RAC_PATRIM0_PATRIMVREF0DBM_v_987p5m                           (_RAC_PATRIM0_PATRIMVREF0DBM_v_987p5m << 27)         /**< Shifted mode v_987p5m for RAC_PATRIM0       */

