SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_rac.h
/* Bit fields for RAC RFPATHEN1 */
#define _RAC_RFPATHEN1_RESETVALUE                                     0x00000004UL                                        /**< Default value for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_MASK                                           0x000000FFUL                                        /**< Mask for RAC_RFPATHEN1                      */
#define RAC_RFPATHEN1_LNAMIXEN0DBMPA1                                 (0x1UL << 0)                                        /**< LNAMIXEN0DBMPA1                             */
#define _RAC_RFPATHEN1_LNAMIXEN0DBMPA1_SHIFT                          0                                                   /**< Shift value for RAC_LNAMIXEN0DBMPA1         */
#define _RAC_RFPATHEN1_LNAMIXEN0DBMPA1_MASK                           0x1UL                                               /**< Bit mask for RAC_LNAMIXEN0DBMPA1            */
#define _RAC_RFPATHEN1_LNAMIXEN0DBMPA1_DEFAULT                        0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN0DBMPA1_disable                        0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN0DBMPA1_enable                         0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_LNAMIXEN0DBMPA1_DEFAULT                         (_RAC_RFPATHEN1_LNAMIXEN0DBMPA1_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN0DBMPA1_disable                         (_RAC_RFPATHEN1_LNAMIXEN0DBMPA1_disable << 0)       /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN0DBMPA1_enable                          (_RAC_RFPATHEN1_LNAMIXEN0DBMPA1_enable << 0)        /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_LNAMIXEN1                                       (0x1UL << 1)                                        /**< LNAMIXEN1                                   */
#define _RAC_RFPATHEN1_LNAMIXEN1_SHIFT                                1                                                   /**< Shift value for RAC_LNAMIXEN1               */
#define _RAC_RFPATHEN1_LNAMIXEN1_MASK                                 0x2UL                                               /**< Bit mask for RAC_LNAMIXEN1                  */
#define _RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                              0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_disable                              0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_enable                               0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                               (_RAC_RFPATHEN1_LNAMIXEN1_DEFAULT << 1)             /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_disable                               (_RAC_RFPATHEN1_LNAMIXEN1_disable << 1)             /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_enable                                (_RAC_RFPATHEN1_LNAMIXEN1_enable << 1)              /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1                                (0x1UL << 2)                                        /**< LNAMIXRFATTDCEN1                            */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_SHIFT                         2                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN1        */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_MASK                          0x4UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                       0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                    0x00000000UL                                        /**< Mode disable_dc for RAC_RFPATHEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                     0x00000001UL                                        /**< Mode enable_dc for RAC_RFPATHEN1            */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                        (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                     (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc << 2)   /**< Shifted mode disable_dc for RAC_RFPATHEN1   */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                      (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc << 2)    /**< Shifted mode enable_dc for RAC_RFPATHEN1    */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1                                (0x1UL << 3)                                        /**< LNAMIXRFPKDENRF1                            */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_SHIFT                         3                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF1        */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_MASK                          0x8UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF1           */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                       0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                  0x00000001UL                                        /**< Mode enable_path1 for RAC_RFPATHEN1         */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                        (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                        (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable << 3)      /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                   (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1 << 3) /**< Shifted mode enable_path1 for RAC_RFPATHEN1 */
#define RAC_RFPATHEN1_LNAMIXTRSW1                                     (0x1UL << 4)                                        /**< LNAMIXTRSW1                                 */
#define _RAC_RFPATHEN1_LNAMIXTRSW1_SHIFT                              4                                                   /**< Shift value for RAC_LNAMIXTRSW1             */
#define _RAC_RFPATHEN1_LNAMIXTRSW1_MASK                               0x10UL                                              /**< Bit mask for RAC_LNAMIXTRSW1                */
#define _RAC_RFPATHEN1_LNAMIXTRSW1_DEFAULT                            0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXTRSW1_disabled                           0x00000000UL                                        /**< Mode disabled for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_LNAMIXTRSW1_enabled                            0x00000001UL                                        /**< Mode enabled for RAC_RFPATHEN1              */
#define RAC_RFPATHEN1_LNAMIXTRSW1_DEFAULT                             (_RAC_RFPATHEN1_LNAMIXTRSW1_DEFAULT << 4)           /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXTRSW1_disabled                            (_RAC_RFPATHEN1_LNAMIXTRSW1_disabled << 4)          /**< Shifted mode disabled for RAC_RFPATHEN1     */
#define RAC_RFPATHEN1_LNAMIXTRSW1_enabled                             (_RAC_RFPATHEN1_LNAMIXTRSW1_enabled << 4)           /**< Shifted mode enabled for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENANT1                                        (0x1UL << 5)                                        /**< PAENANT1                                    */
#define _RAC_RFPATHEN1_PAENANT1_SHIFT                                 5                                                   /**< Shift value for RAC_PAENANT1                */
#define _RAC_RFPATHEN1_PAENANT1_MASK                                  0x20UL                                              /**< Bit mask for RAC_PAENANT1                   */
#define _RAC_RFPATHEN1_PAENANT1_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENANT1_disable                               0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENANT1_enable                                0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_PAENANT1_DEFAULT                                (_RAC_RFPATHEN1_PAENANT1_DEFAULT << 5)              /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENANT1_disable                                (_RAC_RFPATHEN1_PAENANT1_disable << 5)              /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENANT1_enable                                 (_RAC_RFPATHEN1_PAENANT1_enable << 5)               /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_PAENPA10DBM                                     (0x1UL << 6)                                        /**< PAENPA10DBM                                 */
#define _RAC_RFPATHEN1_PAENPA10DBM_SHIFT                              6                                                   /**< Shift value for RAC_PAENPA10DBM             */
#define _RAC_RFPATHEN1_PAENPA10DBM_MASK                               0x40UL                                              /**< Bit mask for RAC_PAENPA10DBM                */
#define _RAC_RFPATHEN1_PAENPA10DBM_DEFAULT                            0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENPA10DBM_disable                            0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENPA10DBM_enable                             0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_PAENPA10DBM_DEFAULT                             (_RAC_RFPATHEN1_PAENPA10DBM_DEFAULT << 6)           /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENPA10DBM_disable                             (_RAC_RFPATHEN1_PAENPA10DBM_disable << 6)           /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENPA10DBM_enable                              (_RAC_RFPATHEN1_PAENPA10DBM_enable << 6)            /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_PAENPAPREDRV10DBM                               (0x1UL << 7)                                        /**< PAENPAPREDRV10DBM                           */
#define _RAC_RFPATHEN1_PAENPAPREDRV10DBM_SHIFT                        7                                                   /**< Shift value for RAC_PAENPAPREDRV10DBM       */
#define _RAC_RFPATHEN1_PAENPAPREDRV10DBM_MASK                         0x80UL                                              /**< Bit mask for RAC_PAENPAPREDRV10DBM          */
#define _RAC_RFPATHEN1_PAENPAPREDRV10DBM_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENPAPREDRV10DBM_disable                      0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_PAENPAPREDRV10DBM_enable                       0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_PAENPAPREDRV10DBM_DEFAULT                       (_RAC_RFPATHEN1_PAENPAPREDRV10DBM_DEFAULT << 7)     /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENPAPREDRV10DBM_disable                       (_RAC_RFPATHEN1_PAENPAPREDRV10DBM_disable << 7)     /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_PAENPAPREDRV10DBM_enable                        (_RAC_RFPATHEN1_PAENPAPREDRV10DBM_enable << 7)      /**< Shifted mode enable for RAC_RFPATHEN1       */

